<template>
    <div
        class="max-w-2xl mx-auto my-8 bg-gray-50 rounded-xl shadow p-8 text-lg leading-relaxed text-accent-primary"
    >
        <h1 class="text-2xl font-bold text-center mb-6">
            Політика конфіденційності
        </h1>
        <p class="mb-4">
            Ваша приватність важлива для ГО "NU31 hacker space". Ми прагнемо
            захищати вашу особисту інформацію та використовуємо її лише для
            забезпечення роботи наших сервісів.
        </p>
        <p class="mb-4">
            Ми збираємо лише мінімальний обсяг персональних даних, необхідних
            для реєстрації, надання доступу до наших ресурсів і покращення
            якості обслуговування. Ваші дані не передаються третім особам без
            вашої згоди, крім випадків, визначених законом.
        </p>
        <p class="mb-4">
            Ви маєте право переглядати, змінювати або видаляти свої персональні
            дані. Для цього зв’яжіться з адміністрацією ГО "NU31 hacker space".
        </p>
        <p>
            Якщо у вас виникли питання щодо нашої політики конфіденційності,
            будь ласка, звертайтеся до нас через офіційні канали зв’язку.
        </p>
    </div>
</template>

<script setup lang="ts">
import { definePageMeta } from '#imports'

definePageMeta({
    layout: 'doc',
})
</script>
