<template>
    <div
        class="max-w-2xl mx-auto my-8 bg-gray-50 rounded-xl shadow p-8 text-lg leading-relaxed text-accent-primary"
    >
        <h1 class="text-2xl font-bold text-center mb-6">Умови користування</h1>
        <p class="mb-4">
            Ласкаво просимо до ГО "HU31 hacker space". Користуючись нашими
            сервісами, ви погоджуєтеся дотримуватися цих Умов користування. Будь
            ласка, уважно ознайомтеся з ними перед початком використання.
        </p>
        <p class="mb-4">
            Всі сервіси та простір ГО "HU31 hacker space" призначені виключно
            для мирної, освітньої та творчої діяльності. Забороняється
            використовувати ресурси організації для незаконної діяльності чи
            дій, які можуть призвести до шкоди іншим користувачам або
            обладнанню.
        </p>
        <p class="mb-4">
            Користувачі зобов’язані поважати один одного та дотримуватися
            етичних норм спільноти. Адміністрація залишає за собою право
            обмежувати доступ до сервісів у разі порушення цих Умов.
        </p>
        <p>
            Якщо у вас виникли питання або пропозиції, звертайтеся до
            адміністрації ГО "HU31 hacker space".
        </p>
    </div>
</template>

<script setup lang="ts">
import { definePageMeta } from '#imports'

definePageMeta({
    layout: 'doc',
})
</script>
